[
  {
    "sentence": "The quick brown fox jumps over the lazy dog.",
    "translation": "敏捷的棕色狐狸跳过懒惰的狗。",
    "difficulty": 1
  },
  {
    "sentence": "Knowledge is power, and education is the key to unlock it.",
    "translation": "知识就是力量，教育是打开知识之门的钥匙。",
    "difficulty": 2
  },
  {
    "sentence": "The advancement of technology has revolutionized the way we communicate.",
    "translation": "技术的进步彻底改变了我们交流的方式。",
    "difficulty": 3
  },
  {
    "sentence": "Success is not final, failure is not fatal: it is the courage to continue that counts.",
    "translation": "成功不是终点，失败也不是致命的：重要的是继续前行的勇气。",
    "difficulty": 3
  },
  {
    "sentence": "The library is open from Monday to Friday.",
    "translation": "图书馆周一到周五开放。",
    "difficulty": 1
  },
  {
    "sentence": "Climate change poses a significant threat to our planet's future.",
    "translation": "气候变化对我们地球的未来构成重大威胁。",
    "difficulty": 3
  },
  {
    "sentence": "She decided to pursue a career in computer science.",
    "translation": "她决定从事计算机科学方面的职业。",
    "difficulty": 2
  },
  {
    "sentence": "The conference will be held next month in Beijing.",
    "translation": "会议将于下个月在北京举行。",
    "difficulty": 2
  },
  {
    "sentence": "Regular exercise and a balanced diet are essential for good health.",
    "translation": "定期锻炼和均衡饮食对身体健康至关重要。",
    "difficulty": 2
  },
  {
    "sentence": "The novel explores themes of love, loss, and redemption.",
    "translation": "这部小说探讨了爱情、失落和救赎的主题。",
    "difficulty": 3
  },
  {
    "sentence": "I need to finish my homework before watching TV.",
    "translation": "我需要在看电视之前完成作业。",
    "difficulty": 1
  },
  {
    "sentence": "The economic situation has improved significantly over the past year.",
    "translation": "过去一年里经济状况显著改善。",
    "difficulty": 3
  },
  {
    "sentence": "Learning a new language opens doors to different cultures.",
    "translation": "学习一门新语言为了解不同文化打开大门。",
    "difficulty": 2
  },
  {
    "sentence": "The team worked collaboratively to solve the complex problem.",
    "translation": "团队协作解决了这个复杂的问题。",
    "difficulty": 3
  },
  {
    "sentence": "Technology has made our lives more convenient and efficient.",
    "translation": "技术使我们的生活更加便利和高效。",
    "difficulty": 2
  },
  {
    "sentence": "The museum exhibits artifacts from ancient civilizations.",
    "translation": "博物馆展出了古代文明的文物。",
    "difficulty": 2
  },
  {
    "sentence": "Environmental protection requires collective effort from everyone.",
    "translation": "环境保护需要每个人的集体努力。",
    "difficulty": 3
  },
  {
    "sentence": "The student demonstrated exceptional performance in mathematics.",
    "translation": "这名学生在数学方面表现出色。",
    "difficulty": 2
  },
  {
    "sentence": "Innovation drives progress in science and technology.",
    "translation": "创新推动科学技术的进步。",
    "difficulty": 3
  },
  {
    "sentence": "Reading books expands your vocabulary and imagination.",
    "translation": "读书能扩大你的词汇量和想象力。",
    "difficulty": 2
  }
]